'number' + 3 + 3 
значення з + це конкатенація 'number3' + 3 → 'number33'
Відповідь 'number33'


null + 3
null в числовому контексті = 0
0 + 3 = 3
Відповідь 3


5 && "qwerty"


+'40' + +'2' + "hillel";
Унарний + перетворює рядок у число
+'40' → 40 та +'2' → 2 тож 40+2=42 та тепер + hillel
Відповідь "42hillel"


'10' - 5 === 6;     false
Оператор - перетворює '10' → число 10 та 5 → число 5
тому 10 - 5 = 5 далі  === 6 
5 === 6 → 
Відповідь false


true + false 
Булеві значення перетворюються на числа true → 1 та false → 0  
1 + 0 = 1
Відповідь 1


'4px' - 3    
Оператор - перетворює значення на числа
'4px' не можна перетворити це NaN а 3 це число
NaN - 3 = NaN
Відповідь NaN


'4' - 3 
Оператор - перетворює значення на числа  
4 - 3 = 1   
Відповідь 1


'6' + 3 ** 0;
Відбувається піднесення до степеня 3 ** 0 = 1    
Далі '6' + 1 
+ кокантинація '6' + '1' = '61'
Відповідь '61'


12 / '6'  
/ перетворює значення на числа
12 → число '6' → рядок, який можна перетворити на число → 6    
12 / 6 = 2 
Відповідь 2



'10' + (5 === 6);    '10false'

null == ''      false

3 ** (9 / 3);     27

!!'false' == !!'true'     false

0 || '0' && 1      0 

(+null == false) < 1;       false

false && true || true     true

false && (false || true);       false

(+null == false) < 1 ** 5;   
спочатку рахуємо те що в дужках null=0 false=0
далі степінь і булеве значення приводим в степінь виходить 1 < 1
Відповідь false